{
  "items": [
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-804198",
      "title": "Bank of Israel Governor Amir Yaron to speak at Jerusalem Post Annual Conference",
      "description": "\"The Israeli economy has the necessary foundations to come back and prosper after the war,\" said Amir Yaron.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 4
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-804010",
      "title": "Bank Leumi concludes first quarter of 2024 with net income of approximately NIS 2.8 billion",
      "description": "Leumi continues to focus on growing its corporate, commercial, and mortgage credit portfolios.",
      "relevanceForFamilies": 2,
      "relevanceForSmallBusinesses": 5
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-802482",
      "title": "Inheritance tax changes may trap UK olim",
      "description": "Olim from the UK frequently assume that by making aliyah, their liability to British estate taxes disappear. Unfortunately, this is far from true.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-802242",
      "title": "Israeli municipal tax to jump by 5%, biggest rise in 17 years",
      "description": "Local municipalities can request an exception to the updated rate set by the Interior Ministry, meaning some could charge an even higher rate if they receive approval.",
      "relevanceForFamilies": 5,
      "relevanceForSmallBusinesses": 4
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-801485",
      "title": "Israel-Hamas war could be won through economic alternatives",
      "description": "As recently as June 18, 2023, the Israeli government gave preliminary approval for Gaza gas development, making the October 7 massacre even more deplorable.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 4
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-800595",
      "title": "Bank Leumi to open National Infrastructures department",
      "description": "In the past few years, Bank Leumi led the financing of a number of prominent projects including the Purple Line of the Tel Aviv Light Rail.",
      "relevanceForFamilies": 2,
      "relevanceForSmallBusinesses": 5
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-800077",
      "title": "Israeli average real wages increase slightly in March 2024 - CBS",
      "description": "The average salary for Israeli employees was NIS 14,108 in March 2024.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 3
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-799586",
      "title": "What is the impact of October 7 on Israel's economy?",
      "description": "According to David Zaikin, founder and CEO of the Key Elements Group, the Jewish state's economy has proven resilient.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 4
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-804157",
      "title": "Filling in the gaps: How many foreign workers landed in Israel last week?",
      "description": "The Population and Immigration Authority reports progress in recruiting foreign workers for the construction industry, facing a severe shortage since October 7. About 2,000 arrived last week.",
      "relevanceForFamilies": 2,
      "relevanceForSmallBusinesses": 5
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-804148",
      "title": "Undoubtedly the cheapest apartment sold in Israel in recent years",
      "description": "A 2.5-room apartment in Dimona, ground floor, 54 sqm, was sold for a remarkably low price, far below current market rates in Israel and significantly less than the average per square meter in Dimona.",
      "relevanceForFamilies": 5,
      "relevanceForSmallBusinesses": 1
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-803835",
      "title": "In your city? 10 new urban renewal projects announced",
      "description": "Government Authority for Urban Renewal announces 10 new evacuation-construction complexes across five cities, replacing 1,169 existing apartments with 3,931 new units.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 4
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-803684",
      "title": "Rishon LeZion and Bat Yam: Cities announced for discount apartment raffle",
      "description": "The Construction and Housing Ministry reveals the cities for the upcoming apartment lottery, opening Monday. A quarter of the apartments are for the ultra-Orthodox, with priority for reservists.",
      "relevanceForFamilies": 5,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-802341",
      "title": "For approximately NIS 145 Million: Companies to Build 94 Apartments in Herzliya Studios",
      "description": "The Israel Land Authority reports tender for 94 Herzliya Studios apartments is complete, planning a 350-housing neighborhood. Offer: NIS 20M above minimum but the appraised value.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-802383",
      "title": "Talbiyeh’s timeless appeal - one of Jerusalem’s most elegant neighborhoods",
      "description": "Modern Talbiyeh is a blend of its historic roots and contemporary influences, attracting a diverse population.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801890",
      "title": "This trail starts here: Soon the health city of Israel",
      "description": "About 150 members of Sheba Medical Center toured the site for the new Be'er Sheva and Negev hospital, which, according to Prof. Yitshak Kreiss, \"is unlike any medical center in Israel or the world.\"",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 3
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801863",
      "title": "The restoration begins: Plan approved to transform Ofakim from end to end",
      "description": "Significant boost to the South: Israel Land Authority approves expansion of 'Afikei Nahal' neighborhood with 5,800 new apartments and extensive commercial and public spaces.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 3
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801695",
      "title": "Is there a solution to Israel’s foreign worker crisis? \"My Outline\" launched",
      "description": "To reduce worker shortages in various industries, especially construction, the government will approve Yossi Shelley's outline, aimed at lowering contractor costs and reducing the cost of living.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 5
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801377",
      "title": "Registration opening soon for discount apartment lottery",
      "description": "Construction and Housing Ministry announces upcoming discount apartment lottery registration, giving priority to active reservists. Find out how many apartments will be raffled and where.",
      "relevanceForFamilies": 5,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-800861",
      "title": "Evacuees' return to the South: Hundreds of apartments approved in quick procedure",
      "description": "The National Planning and Construction Council approved an exemption for 300+ housing units for Kfar Gaza evacuees in Kibbutz Ruchama, mostly from Kibbutz Shafiim.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 3
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-800424",
      "title": "Surprising price: Tel Aviv entrance land sold for surprising price",
      "description": "Israel Land Authority announces winners of the tender for 528 apartments at the IMI Systems Hashalom complex entrance. Who won and for how much?",
      "relevanceForFamilies": 2,
      "relevanceForSmallBusinesses": 3
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-800302",
      "title": "End factory noise: Peace for town residents",
      "description": "Putting an end to the noise from the factory: Machines are seized by the Land Enforcement Authority for prohibited use, posing an environmental hazard to nearby settlement residents.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-800035",
      "title": "Israel already employing 28,000 Palestinians; Renovation sector in crisis",
      "description": "Renovation Contractors Association finds 20% hiring Palestinians without entry permits due to manpower shortage.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 5
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-799932",
      "title": "Rising prices in Israel: Impact on second-hand apartments? View this week's deals",
      "description": "Amid the economic celebration, are second-hand apartment prices soaring in your city too? Explore this week's transactions in the used apartment market.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 3
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-799916",
      "title": "City in decline: No buyers for Kiryat Shmona apartments, in existential peril",
      "description": "Despite signs of recovery in other war-torn cities, Kiryat Shmona remains deserted, with a staggering 95% drop in real estate transactions. Is it worth considering an investment? We investigate.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-799518",
      "title": "Ghost apartments: How empty homes haunt Jerusalem's housing landscape",
      "description": "The term \"ghost apartments\" remain unoccupied for extended periods, often year-round. This is how they profoundly impact the housing market in Israel's capital.",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 2
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-799572",
      "title": "Government approves M2 metro line plan: Cities it passes through",
      "description": "Good news for Gush Dan residents: the government greenlights the M2 metro line's route today, spanning 25km from Holon's Yoseftal interchange to Petah Tikva's Segulah area. Which cities will benefit?",
      "relevanceForFamilies": 4,
      "relevanceForSmallBusinesses": 4
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/real-estate/article-799553",
      "title": "Contractors Warn: War & Turkish boycott impact on construction",
      "description": "The Contractors Association's scathing letter to PM and finance minister warns of industry collapse due to labor shortage and Turkey's boycott, urging immediate action to avert a crisis.",
      "relevanceForFamilies": 3,
      "relevanceForSmallBusinesses": 5
    },
    {
      "link": "https://www.jpost.com/business-and-innovation/energy-and-infrastructure/article-802121",
      "title": "Bazan Group reports strong financial performance in Q1 2024",
      "description": "Key financial figures for the first quarter include an operating cash flow of $149 million (before changes in working capital and tax) and the acquisition of fixed assets amounting to $25 million",
      "relevanceForFamilies": 2,
      "relevanceForSmallBusinesses": 5
    }
  ]
}