[
    {
        "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-802242",
        "title": "Israeli municipal tax to jump by 5%, biggest rise in 17 years",
        "description": "\n\n\n\n\n\nIsraeli municipal tax to hike by 5% as cost of living crisis deepens - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nBanking & Finance\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nIsraeli municipal tax to jump by 5%, biggest rise in 17 years\n\nLocal municipalities can request an exception to the updated rate set by the Interior Ministry, meaning some could charge an even higher rate if they receive approval.\n\n\n\n\nBy  WALLA! FINANCE\n\n\n\n\n\r\n                            MAY 22, 2024 17:39\r\n                        \n\nUpdated: MAY 22, 2024 22:47\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHouse and calculator [Illustrative].\n(photo credit: INGIMAGE)\n\n\n\n\n\n\n\n\n\n\n\nThe cost of living in Israel could soon get costlier after the Interior Ministry announced on Tuesday evening that the arnona (municipal tax) rate would rise by 5.29% next year.This represents the largest jump in arnona cost in over 17 years. In contrast, the Arnona rate rose by 2.68% last year, while in the three years prior, it rose by less than 2%.The largest rate hike observed in recent years before this week occurred in 2009 when the arnona rates rose by 4.57%.  Local municipalities can request an exception to the updated rate set by the Interior Ministry, meaning some could charge an even higher rate if they receive approval.The rate is determined automatically by a mechanism introduced as part of the Arrangements Law in 2007. It considers recent changes in the Consumer Price Index and the average annual salary. Construction at the entrance of Jerusalem (credit: MARC ISRAEL SELLEM/THE JERUSALEM POST)Opposition: Government is taking money out of Israelis' pocketsThe opposition's Knesset's Finance Committee coordinator, Yesh Atid MK Vladimir Beliak, blasted the government for a false promise to \"freeze arnona\" before the 2022 election.\"From the government's formation, they promised to freeze the arnona. This recent hike is crazy and brazen, especially as [the government] continues to celebrate their NIS 10 billion coalition funds.\"At least a dozen useless ministers are still walking among us, all of them costing us approximately two billion shekels. Every day this government survives, it harms citizens' security and resiliency and takes money out of their pockets.\"Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nFinance Ministry\n\n\n\n\nYesh Atid\n\n\n\n\nbusiness\n\n\n\n\ncost of living in israel\n\n\n\n\nproperty tax israel\n\n\n\n\nInterior Ministry\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-803835",
        "title": "In your city? 10 new urban renewal projects announced",
        "description": "\n\n\n\n\n\nIn your city? 10 new urban renewal projects announced - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nIn your city? 10 new urban renewal projects announced\n\nGovernment Authority for Urban Renewal announces 10 new evacuation-construction complexes across five cities, replacing 1,169 existing apartments with 3,931 new units.\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 27, 2024 15:32\r\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Illustration: urban renewal of the Metropolis company in Tel Aviv.\n(photo credit: Yanai Alfasi)\n\n\n\n\n\n\n\n\n\n\n\nNews of renewal throughout the country: Elazar Bamberger, the CEO of the Governmental Authority for Urban Renewal, announced the development of 10 new evacuation-construction complexes in five cities. The complexes include the demolition of 1,169 existing apartments and the construction of 3,931 new ones.Nine of the complexes are promoted in the \"taxation track,\" intended for those in which the planning is carried out at the initiative of a private developer. The other complex is promoted in the \"authority track,\" in which its planning  is carried out by the authority. The tax provisions in the law, essential for the realization of the project, also waive the arrangements stipulated in the law regarding \"reluctant tenants.\" The announcement is made at a relatively advanced stage of the project after the plan has been submitted to objections by the authorized planning institution for approval, and after the developer has completed signing the evacuation-construction (Pinui u'Binui) agreements with at least 67% of the apartment owners in the project, so that these are complexes that are at a high level of maturity for implementation.   By a legislative amendment approved in 2021, the director-general of the authority is authorized by law to declare construction evacuation complexes, a power previously vested in the Minister of Construction and Housing, thus involving a longer procedure.Kiryat Yuvel neighborhood in Jerusalem. (credit: REUVEN CASTRO)In your city? These are the announced complexesJerusalem Projects:- Shalom Yehuda Complex 16-18 - Located in the Talpiot neighborhood between Shalom Yehuda and Derech Hevron streets. The project will demolish 41 housing units and build 160 new ones. Developer: Shalom Yehuda 16-18 Urban Renewal Ltd.- Berger on the Park Complex - Situated in the Pat neighborhood between Bar Yohai and San Martin streets. The project will demolish 72 housing units and build 242 new ones. Developer: Berger on Park Gonen Ltd.- Complex Haim Haviv 3 - Located in the Kiryat HaYovel neighborhood between Haim Haviv and Meir Avner streets. The project will demolish 50 housing units and build 165 new ones. Developer: Pardes N.B.S Ltd.- Guatemala Complex - Situated in the Kiryat HaYovel neighborhood between Guatemala and Bolivia streets. The project will demolish 186 housing units and build 612 new ones. Developer: Azorim Benin (1965) Ltd. Advertisement- Katamonim Complex 6 - Located in the Gonenim neighborhood between Bar Yohai and Abraham Elmaliah streets. The project will demolish 162 housing units and build 691 new ones. Developer: Beit Yerushalmi Group Ltd.Other City Projects:- The HaOmanim Complex - Rishon Lezion - Located in the Revivim neighborhood between Atarot and Gush Etzion streets. The project will demolish 8 housing units and build 40 new ones. This announcement joins 216 housing units already announced for evacuation and construction. Developer: Donitz Kiryat HaOmanim Ltd.- The Rabbi Shauli Complex - Ashdod - Located in the D District neighborhood between Sderot Herzel and Rabbi Shauli streets. The project will demolish 48 housing units and build 342 new ones. Developer: Y. H. Dimri.- Lev Ha'ir Complex (Complex A) - Ramat Hasharon - Located in the Kiryat Yearim neighborhood between Zalman Shneor, Sokolov, and Weizman boulevards. The project will demolish 67 housing units and build 122 new ones. Developer: Oranim Enterprises and Construction Ltd.- The Eilat - Bat Yam Complex - Located in the Ramat Yosef neighborhood between Eilat Shalom Ash and Operation Sinai streets. The project will demolish 192 housing units and build 700 new ones. Developer: Eridaniel Pinoy Binui Ltd.- Komemiut metro Complex - Bat Yam - Announced under the route of authorities, located in the Nevi’im neighborhood between Komemiut and Nevi’im streets. The project will demolish 343 housing units and build 857 new ones. Planning was done by the Governmental Authority for Urban Renewal.Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nconstruction\n\n\n\n\nreal estate israel\n\n\n\n\nurban renewal\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-803684",
        "title": "Rishon LeZion and Bat Yam: Cities announced for discount apartment raffle",
        "description": "\n\n\n\n\n\nRishon LeZion and Bat Yam: Cities announced for discount apartment raffl - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nRishon LeZion and Bat Yam: Cities announced for discount apartment raffle \n\nThe Construction and Housing Ministry reveals the cities for the upcoming apartment lottery, opening Monday. A quarter of the apartments are for the ultra-Orthodox, with priority for reservists.\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 27, 2024 10:37\r\n                        \n\nUpdated: MAY 27, 2024 10:38\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n(photo credit: INGIMAGE)\n\n\n\n\n\n\n\n\n\n\n\nImmediately after Lag Ba'Omer: The Construction and Housing Ministry and the Israel Lands Authority (ILA) will open registration for the next discount apartment lottery on May 27. Registration will last until Monday, June 17. As part of the lottery, some 4,633 housing units will be raffled across the country, including in the following localities: Migdal Ha'Emek, Bnei Ayish, Elad, Dimona, Kiryat Gat, and more. Additionally, for the first time in the discount apartment lottery, apartments in Aksal, Efrat, Deir al-Assad, and Tzur Hadassah will be drawn. The projects show that more than 1,000 apartments (almost a quarter of all the housing units offered) are concentrated in two localities with a prominent ultra-Orthodox population: Elad and Rekhasim.   Furthermore, the next lottery also brings good news for reservists: for the first time, a 20% priority will be given to active reservists, following the decision of the Israel Lands Council, headed by Construction and Housing Minister Yitzhak Goldknopf.Who is eligible and how do you register?Homeless individuals with a valid eligibility certificate are eligible to register for the lottery. As in previous lotteries, eligible participants can register for three cities and all the lotteries in these cities. The date of registration during the registration period does not affect eligibility. Please note: The ministry emphasizes that the issuance of eligibility certificates to be able to register in this lottery is currently open and will close on Thursday, May 30, three days after the opening of the lottery. After that, it will not be possible to issue certificates until registration for the lottery is closed. Eligibility certificates can be issued online without needing to visit branches physically. The process is conducted through the digital branches of the registration companies Alonim, Milgam, and Amidar. The cost of issuing the eligibility certificate is NIS 240. The procedure takes up to 10 days; the approval is valid for one year, and must be extended before it expires. To contact the registration companies: - Alonim (Mgroup company): *2850 - Milgam: *6078  Advertisement- Amidar: *6266\"Later this year we will build thousands of additional housing units\"\"Immediately after Lag Ba'Omer, we will open the registration for the new lottery for a 'discount apartment,'\" Goldknopf said. \"For the first time, a 20% priority will be given to reservists, a decision I initiated and brought to the ILA Council for approval.\"In the upcoming lottery, apartments are offered nationwide, for example in Jerusalem, Tel Aviv, Migdal Ha'Emek, Dimona, Bat Yam, Elad, Rekhasim, Beit She’an, and more. Later this year, there will be thousands more apartments in the lottery.\"Ministry Director-General Yehuda Morgenstern said: \"Purchasing a first home provides stability and security, which we promote for all Israeli citizens in various ways and environments all the time, now with a special emphasis on reservists. The expansion of the cities where apartments will be offered is also intended to produce suitable solutions for various populations and increase public resilience.\"I call on all those eligible to register for the lottery and exercise their rights.\"ILA Manager Yankee Quint said: \"We continue the discount programs and the variety of benefits in affordable housing solutions for families and young people nationwide. We will continue to provide housing solutions and land allocations according to the population's needs and the government's goals. The benefit for active reservists is an important and significant statement by the state and the government towards the reservists and their families.\"Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nisrael real estate\n\n\n\n\napartments\n\n\n\n\nIsrael Land Authority\n\n\n\n\nlottery\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801377",
        "title": "Registration opening soon for discount apartment lottery",
        "description": "\n\n\n\n\n\nRegistration opening soon for discount apartment lottery - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nRegistration opening soon for discount apartment lottery\n\nConstruction and Housing Ministry announces upcoming discount apartment lottery registration, giving priority to active reservists. Find out how many apartments will be raffled and where.\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 16, 2024 10:51\r\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n A construction site \n(photo credit: Gili Yaari Flash 90)\n\n\n\n\n\n\n\n\n\n\n\nThe Construction and Housing Ministry, in collaboration with the Israel Land Authority (ILA), has announced that registration for the upcoming discount apartment lottery will kick off shortly after Lag Ba'omer.Starting on Monday, May 27, individuals can register for the lottery until Monday, June 17. Around 4,000 housing units will be up for grabs across the country, including cities like Migdal Ha'Emek, Elad, Dimona, Kiryat Gat, and more.Active reservists will receive a 20% priority in the lottery, as decided by the Israel Lands Council chaired by Minister Yitzhak Goldknopf.   Who is eligible and how do you register?Those eligible to register for the lottery are homeless individuals with valid eligibility approval. As in previous lotteries, eligible individuals can register for up to three cities, and for all lotteries in these cities. Also, when you register for the lottery during the registration period has no significance as far as your chances to win.Note: The ministry emphasizes that the option to issue eligibility approvals is currently open and will close on Thursday, May 30, three days after the lottery opens. After that, approvals will not be issued until the registration for the lottery is closed. Access approvals for registration can be obtained online without physically visiting branches. The issuance process is carried out at the digital branches of registration companies Alonim, Milgam, and Amidar. The cost of obtaining an eligibility approval is NIS 240. The issuance process takes up to 10 days, and the approval is valid for one year and must be renewed before it expires. To contact the registration companies:• Alonim (Mgroup company): 2850* • Milgam: 6078*  Advertisement• Amidar: 6266*\"In the coming year, we will raffle off thousands of additional housing units.\"\"I am delighted and honored to announce that following Lag Ba'omer, registration will commence for a new lottery under the 'Discount Apartment' program,\" Goldknopf said. \"For the first time, 20% priority will be granted to reservists, enabling them to acquire an apartment at a substantial discount from the state, laying the foundation for their family's future.\"This decision, approved by the ILA Council, marks a significant step in our efforts to provide housing solutions for young families across Israel. Later this year, we will [offer] thousands of more units through these lotteries.\"Ministry Director-General Yehuda Morgenstern affirmed: \"As pledged, after Lag Ba'omer, we will construct approximately 4,000 housing units to address the housing shortage in Israel. The forthcoming lottery is a direct continuation of the comprehensive measures we are implementing to meet the escalating housing demands.\"By injecting over a billion shekels to expedite real estate, advance projects and overcome obstacles, we are working diligently to deliver tangible results,\" he said. \"I urge all eligible participants to obtain their eligibility certificates promptly and register for the lottery without delay.\"ILA Director-General Yankee Quint said: \"Despite the challenges posed by the current circumstances, we remain committed to accelerating efforts to provide housing solutions for Israel's residents. \"Immediately following Lag Ba'omer, lotteries will once again open for the 'discount apartment' program, offering thousands of eligible young families and individuals substantial discounts and the opportunity to secure their own homes in various cities and towns.\"Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nconstruction\n\n\n\n\nisrael real estate\n\n\n\n\nIsrael Land Authority\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-799572",
        "title": "Government approves M2 metro line plan: Cities it passes through",
        "description": "\n\n\n\n\n\nGovernment approves M2 metro line plan: Cities it passes through - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nGovernment approves M2 metro line plan: Cities it passes through\n\nGood news for Gush Dan residents: the government greenlights the M2 metro line's route today, spanning 25km from Holon's Yoseftal interchange to Petah Tikva's Segulah area. Which cities will benefit?\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 3, 2024 09:57\r\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n(photo credit: INGIMAGE)\n\n\n\n\n\n\n\n\n\n\n\nPetah Tikva and Holon: The government finally approved the M2 metro line, the fourth plan among the plans for metro lines in the Gush Dan metropolis. The only metro line that the government has not yet approved is in the section of the M1 line that is supposed to pass in the northern part of the metropolis, through the cities of Kfar Saba, Ra'anana, and Hod Hasharon. The delay is due to opposition from the residents, which was received by the planning administration. Not deciding on another alternative is expected to lead to a significant delay in the implementation of the plan and even its cancellation. In the past there was also opposition to the M2 line, because work on the Bnei Brak station must continue and be carried out even on Shabbat – which, according to the municipality, harms the character of the city.  In the end, last September, the plan was approved in principle after the Bnei Brak municipality actually agreed to work on Shabbat within the city limits in the metro project, as long as they were carried out underground without public visibility and after they were defined as \"mind control.\"The decision as to which works will be defined in this way will be up to the Metropolitan Mass Transit System (NTA) company, and will also apply to the operation of the underground mining machines, the cessation of which upon completion of the work could lead to the collapse of the tunnels.This is the largest infrastructure project ever undertaken in Israel, costing approximately NIS 150 billion. According to the plan, lines of the metro in Israel will connect the entire Tel Aviv metropolis, from Lod, Ramla and Rehovot in the south to Ra'anana and Kfar Saba in the north and Petah Tikva in the east. It will be an additional and main answer to easing congestion on the roads, increasing investment in public transportation and shortening travel distances to employment centers in the metropolis.Which cities will it pass through?The length of the line is approximately 25 km. and it is an east-west axis that will connect the center of the metropolis with its eastern part. The route begins at the Yoseftal interchange in northern Holon and passes through southern and central Tel Aviv, continuing through the cities of Givatayim, Ramat Gan, Bnei Brak, Givat Shmuel, and Petah Tikva and ending near the employment area of Petah Tikva. The line will serve areas designated for urban renewal along with providing service to important metropolitan centers such as the Wolfson Hospital, the main business area of Tel Aviv, and Bar Ilan University.The line will be at the interface with other public transportation system lines: Metro-HaShalom (1M) and Kfar Ganim (3M); stations of the Israel-HaShalom train, Segulah Petah Tikva; Light rail line stations: the Red Line – the Hasmoneans; the green line – Hamima Square; and the Purple Line – Allenby, Bar Ilan and Kfar Ganim. Advertisement\"There is no future for Gush Dan without the metro.\"Rabbi Natan Alnatan, chairman of the National Planning Headquarters and of the National Council for Planning and Construction, said: \"I welcome the approval of the M2 metro line. The metro project is an essential project for the State of Israel in general and the Gush Dan in particular and will significantly shorten the traffic jams.\" Planning Administration Director-General Rafi Elmaliah said: \"This is a historic day. The Planning Administration has made the promotion of the metro project a priority and we have approved four plans in a record time of only two years. There is no future for Gush Dan without the metro.\" NTA CEO Haim Glick said his company is: \"proud of the government's decision to approve the M2 metro line and sees the decision as an expression of confidence in NTA's professionalism and its unique professional experience in mass transportation above and below ground. These days, the international management companies chosen to promote the major infrastructure project in Israel have started their work.\"Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nconstruction\n\n\n\n\ntransportation\n\n\n\n\ninfrastructure\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-800077",
        "title": "Israeli average real wages increase slightly in March 2024 - CBS",
        "description": "\n\n\n\n\n\nIsraeli average real wages increased slightly in March - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nBanking & Finance\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nIsraeli average real wages increase slightly in March 2024 - CBS\n\nThe average salary for Israeli employees was NIS 14,108 in March 2024.\n\n\n\n\nBy  EVE YOUNG\n\n\n\n\n\r\n                            MAY 6, 2024 14:37\r\n                        \n\nUpdated: MAY 6, 2024 18:16\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Illustration of  Israeli shekels, September 24, 2023\n(photo credit: HADAR YOUAVIAN/FLASH90)\n\n\n\n\n\n\n\n\n\n\n\nPartial data from Israel's Central Bureau of Statistics indicates that average wages for  Israeli employees went up by 3.5% in March when compared to March of 2023. Israel’s inflation was around 2.7% in that timeframe, meaning that the increase in real average wages was not very large.Real wages are wages adjusted for inflation. As the prices of goods and services increase over time, the same amount of money can be used to buy less. Real wage increases indicate how much more employees can buy with increased wages.The average salary for Israeli employees was NIS 14,108 in March was up 1% from February, and down 1.8% from March 2024.   The number of positions filled by Israeli employees in Israel in March was up 1.1% from February, but down by 4.4% from March of 2023.OUTSIDE THE Jerusalem Employment Office (credit: MARC ISRAEL SELLEM/THE JERUSALEM POST)Average wages for all employees in Israel (not only Israeli employees) increased by 5% when comparing March 2024 to March 2023.In February, CBS data showed an increase of 6.5% in average real wages for Israeli employees, and average wages were NIS 13,539 for employees in Israel.The number of positions filled by employees in February increased by 0.5% from January of 2024, but was still down 1.7% from February of 2023, said the bureau.Average wage for hi-tech workers rises by 13.2%The average wage for Israel's hi-tech workers increased by 13.2% between February of 2023 and February of 2024 and these jobs made up just over 10% of employee positions in the Israeli market in February of 2024.Also, the average February 2024 wage for employees in the hi-tech sector went up around 12% when compared to their average wage in January 2024. AdvertisementComparing average February 2024 wages to average January 2024 wages in the governmental and private, nonprofit sectors, wages remained almost the same, with nonprofit wages going up around 3% and government wages going up around 1%.Further, government jobs made up around 20% of employee positions in Israel in this timeframe and private nonprofits made up around 8%.The same comparison shows that average wages for employee positions in the non-finance company sector also increased by around 3%. These positions made up around 64% of jobs.Wage calculations provided by the bureau were based on data reported by Israel’s National Insurance Institute and did not reference the number of days in the month worked by the employee. Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nIsrael\n\n\n\n\njobs in israel\n\n\n\n\nMoney\n\n\n\n\nemployment\n\n\n\n\nCentral Bureau of Statistics\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-804148",
        "title": "Undoubtedly the cheapest apartment sold in Israel in recent years",
        "description": "\n\n\n\n\n\nUndoubtedly the cheapest apartment sold in Israel in recent years - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nUndoubtedly the cheapest apartment sold in Israel in recent years\n\nA 2.5-room apartment in Dimona, ground floor, 54 sqm, was sold for a remarkably low price, far below current market rates in Israel and significantly less than the average per square meter in Dimona.\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 30, 2024 10:38\r\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n 1215 HaMa’apil St. Dimona\n(photo credit: GOOGLE STREET VIEW)\n\n\n\n\n\n\n\n\n\n\n\nThe cheapest real estate deal in Israel for 2024 has been revealed: a small 2.5-room apartment in Dimona, without a balcony, located on the ground floor of a five-story old building without an elevator. The apartment's location near Damri Center makes it desirable for rentals.Located at 1215 HaMa’apil St. in Dimona, with a total size of 54 square meters (42 square meters in Tabu), the apartment was sold for the astonishingly low price of NIS 380,000—a price unlikely to be seen again in Israel in 2024.This translates to a rare price of NIS 7,037 per square meter, significantly lower than the average in Dimona, which is NIS 8,536 per square meter for three-room apartments, according to updated data from the Yad2 website.  The transaction was handled by the attorney and notary office of Menkin Yaakov, which specializes in finding real estate bargains. \"The apartment was not advertised in any medium and was located through information and connections. A quick negotiation led to its purchase at the aforementioned attractive price. It is advisable to carry out a renovation, estimated at about NIS 40,000. After the renovation, the customer will be able to rent the apartment for about NIS 2,200 a month. This yields a respectable return of 6.5%, far surpassing any bank deposit, not to mention an expected increase in value,\" says attorney Yaakov.\"Apartments that were purchased two or three years ago for NIS 300,000 are now worth about NIS 550,000 or more. There is massive construction of new neighborhoods, as well as the development of commercial and industrial areas. For instance, the Hashahar neighborhood is attracting many young couples from all over the country.\" attorney Menkin Yaakov added.Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nDimona\n\n\n\n\nreal estate israel\n\n\n\n\napartments\n\n\n\n\nsales\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801890",
        "title": "This trail starts here: Soon the health city of Israel",
        "description": "\n\n\n\n\n\nThis trail starts here: Soon the health city of Israel - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nThis trail starts here: Soon the health city of Israel\n\nAbout 150 members of Sheba Medical Center toured the site for the new Be'er Sheva and Negev hospital, which, according to Prof. Yitshak Kreiss, \"is unlike any medical center in Israel or the world.\"\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 22, 2024 10:46\r\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n The area on which the new hospital in Be'er Sheva will be built.\n(photo credit: PR)\n\n\n\n\n\n\n\n\n\n\n\n\"A human and social storm will reach the Negev\": About 150 members from the Sheba Medical Center toured the area where the Peres Medical Center will be located—the new public hospital of Be'er Sheva and the Negev. \"Sheba Negev\" is planned, established, and will be operated by the Sheba Medical Center—one of the ten best hospitals in the world—and will be jointly owned by the United and National Health Funds.According to the plan, Sheba Negev will be the hospital of the future—an innovative, smart, and green medical center that will bring the best standard of public medicine to the residents of Negev. Beds will be staffed by leading medical professionals in their fields.The medical center campus will be located near major access roads (Route 40 and Route 25) and will be surrounded by a comprehensive planning and development envelope that includes a passenger train station, a bus terminal, a business and industrial park, and a new residential neighborhood for hospital employees.  As part of the visit, the Sheba team received an overview of the area on which the hospital will be built from the Nature and Parks Authority and also heard from the planning team of the Be'er Sheva municipality about the development plans for the area surrounding the hospital campus.Afterward, the delegation from Sheba met with Be'er Sheva Mayor Ruvik Danilovich; Prof. Nadav Davidovich, director of the School of Public Health at Ben Gurion University; and Dr. Muhammad Alanbari, chairman of the Yanabia Association, who spoke about the challenges of Bedouin society in the Negev.\"It is unlike anything that exists today in Israel or in the world\"During the tour of the hospital site, Prof. Yitshak Kreiss, director of the Sheba Medical Center, said: \"You can try to explain in words why it is necessary and important to build a public hospital in the Negev, but we came here today not to explain, but to feel.\"We are bringing a human and social storm to the Negev—what we will build is a healthy city in the Negev. This is contemporary Zionism. The human and professional power of Sheba is a powerful engine, and with its help, we are going to open the hospital of the future,\" he said.\"It will be a smart, advanced, and innovative hospital unlike anything that exists today in Israel or in the world. We will not do it alone. We have excellent and determined allies in this project, chief among them Ruvik Danilovich, the mayor of Be'er Sheva, whose partnership is a force multiplier for Sheba. We also have strong partnerships with the United and National Health Insurance Funds,\" Kreiss concluded. Ruvik Danilovich, mayor of Beer Sheva, at the hospital launch event. (credit: PR)The long struggle for the establishment of the new public hospital in Be'er Sheva, culminating in the government's decision at the beginning of last week (Sunday, May 5), was led with determination by Mayor Danilovich over the past 14 years. According to him, \"The new hospital in the Negev that will be built in Be'er Sheva proves that we do not have the privilege to give up. We started the fight to build a hospital in 2014. It took 10 years, but today I know that residents of the Negev are going to receive the best medicine in the world, not only in Israel,\" he said. Advertisement\"It is impossible for citizens who live in one place in the country not to receive the medical services that citizens who live in another place in the same country receive,\" the mayor said. \"The State of Israel must not give up the North and the South.\"Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nNegev\n\n\n\n\nhospital\n\n\n\n\nsheba medical center\n\n\n\n\nisrael real estate\n\n\n\n\nBeer Sheva\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801863",
        "title": "The restoration begins: Plan approved to transform Ofakim from end to end",
        "description": "\n\n\n\n\n\nThe restoration begins: Plan approved to transform Ofakim from end to en - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nThe restoration begins: Plan approved to transform Ofakim from end to end\n\nSignificant boost to the South: Israel Land Authority approves expansion of 'Afikei Nahal' neighborhood with 5,800 new apartments and extensive commercial and public spaces.\r\n\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 21, 2024 08:17\r\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Construction Site.\n(photo credit: SHUTTERSTOCK)\n\n\n\n\n\n\n\n\n\n\n\nHuge news for the residents of the South: The National Committee for the Planning and Construction of Preferred Housing Complexes (Vatamal) approved for deposit on Wednesday a plan promoted by the Israel Land Authority, in cooperation with the Ofakim Municipality, for the continued development of the \"Afikei HaNahal\" (River Beds) neighborhood in the southern Israeli city 20 kilometers west of Beersheba. As part of the plan, which covers an area of about 164 hectares, about 5,800 housing units will be built, including about 5,050 in a diverse mix of 4-16-story buildings and about 750 detached houses. This is in addition to the 6,884 housing units built as part of the neighborhood's northern plan, bringing the total number to almost 12,000. The plan also includes approximately 55,000 square meters of commercial, employment and hotel areas, approximately 34,000 sq. m. of additional commercial space, about 170,000 sq. m. for public buildings and institutions, and approximately 14 hectares of open areas.  Also, as part of the plan, the \"Green Boulevard\" is planned—a main avenue along which built and open public spaces will form the main axis connecting Nahal Petish to the northeast and Nahal Ofakim to the southwest. Additionally, the road infrastructure in the plan extends the original plan's skeleton, including the main urban road (road no. 3), which is planned to become an urban boulevard with intensive residences and commerce. In the southeastern part of the plan, an employment and trade area is planned to complement the local trade within the neighborhood with large stores in an open space. The proposed road infrastructure creates high connectivity and accessibility to public buildings and areas within the neighborhood and its surroundings through a network of walking routes alongside motorized routes, including public transport routes and bicycle paths.\"About a year ago, we successfully completed all the marketing of the first roof agreement, which included 12,500 housing units, with great success and in a shorter time than planned,\" Ofakim Mayor Itzik Danino stated.\"Each published tender was a great success,\" he said. \"In recent months, we have been promoting another roof agreement for the city, which will also market about 12,500 housing units in two main neighborhoods. The additional roof agreement negotiated in the coming weeks will continue a large and significant development boom for the city of Ofakim.\"\"Contribute to strengthening the South and attract a new population\"Vatamal and National Planning Headquarters Chairman Rabbi Natan Alantan said: \"This is an important program that joins a series of programs being promoted in the settlements around Israel, which will contribute to strengthening the South and attract a new population. The plan was promoted thanks to cooperation with the local authority and the Israel Lands Authority.\" Planning Administration Planning Officer Ed. Sigi Barry said: \"The plan in Ofakim is an important complement to the development momentum in the city and contributes to the strengthening of the border settlements. Advertisement\"The plan emphasizes the importance of creating a community public space for the well-being of the residents of the neighborhood, both through the accessibility of unique natural sites that surround the neighborhood and through the layout of public uses that include a sports and recreation center, commercial areas, employment, and more.\"Einav Ringler, director of the Senior Planning and Projects Division at the Israel Land Authority (ILA), remarked, \"The plan, initiated by the Israel Land Authority and the Ofakim Municipality, is another layer in the development of the new neighborhood Afikei HaNahal, which adds approximately 5,800 housing units to the city in a diverse mix and combines commercial and employment areas and areas for public needs. It attaches great importance to the promotion of the plan, especially at this time, for the benefit of the cultivation and promotion of the city, as well as the prosperity of the entire Western Negev.\" ILA Southern Region Director Avishai Kraus said: \"Especially in this period, the Israel Lands Authority sees great importance in promoting the region in general and the city of Ofakim in particular. The plan is one step in a series of actions designed to ensure the region's survival and flourishing for years to come.\"The plan was designed by a team led by architect Jacob Fisher from the office of Fisher Elhanani Architects Ltd. and managed by the office of Julius Chaimovich.Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nconstruction\n\n\n\n\nisrael housing prices\n\n\n\n\nreal estate israel\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "link": "https://www.jpost.com/business-and-innovation/real-estate/article-801695",
        "title": "Is there a solution to Israel’s foreign worker crisis? \"My Outline\" launched",
        "description": "\n\n\n\n\n\nIs there a solution to Israel’s foreign worker crisis? \"My Outline\" laun - The Jerusalem Post \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\r\n                                Advertisement\r\n                            \n \n\n\n\n\n\n\n\n\n\n\n\n\nNY Conf\n\n\nIsrael News\n\n\nHealth & Wellness\n\n\nWORLD NEWS\n\n\nMiddle East\n\n\nBusiness & Innovation\n\n\nOpinion\n\n\nJP Store\n\n\n\n\nLogin\n\n\n\n\n\nLog Out\n\n\n\n\n\n\n\n\n\r\n            Archaeology\r\n        \n\n\n\n\n\r\n            Israel Real Estate\r\n        \n\n\n\n\n\r\n            Judaism\r\n        \n\n\n\n\n\r\n            Kabbalah\r\n        \n\n\n\n\n\r\n            Science\r\n        \n\n\n\n\n\r\n            Antisemitism\r\n        \n\n\n\n\n\r\n            JP Spanish\r\n        \n\n\n\n\n\r\n            Podcasts\r\n        \n\n\n\n\n\r\n            JP Shopping\r\n        \n\n\n\n\n\r\n            Conversation Corner\r\n        \n\n\n\n\n\r\n            Premium\r\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerusalem Post\n\n\n\nBusiness & Innovation\n\n\n\nIsrael Real Estate\n\n\n\n\n\r\n\r\n\r\n\r\n     \r\n    \n\n\nIs there a solution to Israel’s foreign worker crisis? \"My Outline\" launched\n\nTo reduce worker shortages in various industries, especially construction, the government will approve Yossi Shelley's outline, aimed at lowering contractor costs and reducing the cost of living.\r\n\n\n\n\n\nBy  OFER PETERSBURG\n\n\n\n\n\r\n                            MAY 19, 2024 20:23\r\n                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Foreign workers in the construction of the light rail Jabotinsky axis Petach Tikva April 23, 2023\n(photo credit: REUVEN CASTRO)\n\n\n\n\n\n\n\n\n\n\n\nDawn of a new day? After seven months of severe labor shortages across various sectors, especially the construction industry, which has faced a deficit of approximately 90,000 Palestinian workers from Judea and Samaria since October 7, the government announced on Wednesday that it will approve \"My Outline\" for a comprehensive approach to the employment of foreign workers in Israel. The outline was developed under the initiative and leadership of Prime Minister Benjamin Netanyahu.The government's goal is to mitigate worker shortages in various industries and stabilize the economy amid the current security situation. This involves strengthening the supervision and enforcement of foreign worker employment, reducing prohibited brokerage fees, and ensuring the preservation of foreign workers' rights in Israel.According to government estimates, the decision will remove barriers and revise existing regulations to enable uniform treatment of all foreign workers and facilitate quick, orderly decision-making based on the proposed professional infrastructure.  What does the outline include?• The decision states that the quota of foreign workers that can be brought in privately will be increased by another 10,000 workers, beyond the 10,000 foreign workers that were approved in the previous government's proposal that was extended on May 5, 2024. In addition, it will be possible to bring foreign workers to the construction industry according to the outline to be determined by the Construction and Housing Ministry.• It was also decided, in light of the increase in the price of hiring foreign workers—mainly in the construction industry—that the government will work to increase competition between manpower contractors who have a permit to employ foreign workers in the construction industry, thus leading to an increase in the supply of foreign workers in the industry. In this context, it should be noted that the Population and Immigration Authority has already increased the number of manpower companies from 30 to more than 100.• In addition, the decision establishes a procedure for reducing the fees and permit costs that employers pay to the state for bringing in foreign workers. For example, today employers in the construction industry are required to pay fees and permit costs amounting to over NIS 20,000 per year for each worker. According to the decision, the state intends to reduce these permit fees which ultimately affect the cost of living.• The decision also significantly strengthens the supervision of the rights of foreign workers. According to the decision, 442 standards will be added—after staff work done by the Ministry of Treasury—most of which are intended for supervision by the Population and Immigration Authority and the Ministry of Labor. For example, to the latter, which currently has only eight standards, over 100 standards will be added.• The government's decision also says that the state will not approve the bringing in of foreign workers who do not live in countries ranked Tier 1 and Tier 2 by the database of the American State Department concerning human trafficking. This situation will ensure that Israel meets the internationally accepted criteria for bringing in foreign workers. Yossi Shelley, Metzudat Ze'ev, Tel Aviv 8th of November 2022 (credit: REUVEN CASTRO)\"Since the outbreak of war on October 7, 2023, many vital sectors of the economy have suffered due to a lack of workers, which has led, among other things, to an increase in labor costs,\" Prime Minister's Office Director-General Yossi Shelley, stated. Advertisement\"The current outline continues to strengthen various branches of the economy during wartime through a comprehensive package of reducing regulation and bureaucracy, increasing the number of foreign workers, setting standards for supervision, and lowering costs for contractors and the cost of living. We will continue to work tirelessly and in inter-ministerial cooperation to restore and strengthen the Israeli economy.\"\"Success will be tested by the result\"In response to the decision on the new outline for foreign workers that the Prime Minister's Office is expected to bring to the government's approval today, Raul Sargo, president of the Haaretz Builders Contractors Association, said: \"This is an important step in the right direction, but the outcome will test success.\"One of the main barriers to bringing in workers, which is not being addressed in the proposal, is the heavy bureaucracy that has been delaying the arrival of workers for months, which the association has examined and approved abroad,\" he said.\"In addition, it is of great importance to approve new foreign personnel corporations and give them the actual possibility to bring workers,\" Sargo said.\"We very much hope that this time there will be a real change because the construction and infrastructure industry is in a difficult situation that has a dramatic negative effect on construction companies and their quarter of a million Israeli workers, on apartment buyers, and the entire public that is waiting for infrastructure and public buildings, and for the economy in Israel, which is already suffering from a decrease in state revenues and an increase in the deficit.\"Sign up for the Business & Innovation Newsletter >>\n\n\n\n\n\n\n\n\n\n\nRelated Tags\n\n\n\nconstruction\n\n\n\n\neconomy\n\n\n\n\nreal estate israel\n\n\n\n\nPalestinian workers\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\nInformation\t\t\n\nAbout Us\n\n\nContact us\n\n\nFeedback\n\n\nTerms Of Service\n\n\nPrivacy Policy\n\n\nSubscriber Agreement\n\n\nJPost Jobs\n\n\nCancel Subscription\n\n\nSitemap\n\n\nפרסום בג'רוזלם פוסט\n\n\nCustomer Service\n\n\nAdvertise with Us\n\n\n\n\r\nThe Jerusalem Post Group\t\t\n\nBreaking News\n\n\nWorld News\n\n\nIran News\n\n\nMDA Heroes\n\n\nThe Jerusalem Report\n\n\nJerusalem Post Lite\n\n\nחדשות מעריב \n\n\nReal Estate Listings\n\n\nHype\n\n\nSpecial Content\n\n\n50 Jews\n\n\nJP Store\n\n\nBrandBlend\n\n\nHome Services\n\n\n\n\r\nTools and services\t\t\n\nJPost Premium\n\n\nUlpan Online\n\n\nJPost Newsletter\n\n\nOur Magazines\n\n\nLearn Hebrew\n\n\nRSS feed\n\n\nJPost.com Archive\n\n\nDigital Library\n\n\nLists of Jewish holidays\n\n\nLaw\n\n\nלוח חגים ומועדים 2023\n\n\nזמני כניסת שבת\n\n\n\n\r\nSites Of Interest\t\t\n\nPoalim Online\n\n\nJNF-USA\n\n\nWho is Hamas\n\n\n\n\r\n            The Jerusalem Post Customer Service Center can be contacted with any questions or requests:\r\n            \r\n            Telephone: *2421 * Extension 4 Jerusalem Post or 03-7619056\r\n            Fax: 03-5613699\r\n            E-mail: subs@jpost.com\r\n            \r\n            The center is staffed and provides answers on Sundays through Thursdays between 07:00 AM and 14:00 PM and Fridays only handles distribution requests between 7:00 AM and 12:30 PM\r\n            \r\n            For international customers: The center is staffed and provides answers on Sundays through Thursdays between 7AM and 14PM Israel time Toll\r\n            Free number 1-800-448-9291\r\n            Telephone +972-3-761-9056\r\n            Fax: 972-3-561-3699\r\n            E-mail: subs@jpost.com\r\n        \n\n\r\n                Copyright © 2024 Jpost Inc. All rights reserved\r\n                \r\n                    • Terms of Use\r\n                \n\r\n                    • Privacy Policy\r\n                \n\nDesigned by \n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
]